app/models/user.rb

		def name
				[first_name, last_name].join(" ")
		end
#""
		geocoded_by :last_sign_in_ip do |user, result|
				if !user.local? && geocode = result.first
						user.location = "#{geocode.city}, #{geocode.state}, #{geocode.country}"
						user.save
---
UPDATE "users" SET "updated_at" = ?, "location" = ? WHERE "users"."id" = ?  [["updated_at", "2023-10-16 01:24:06.937657"], ["location", ", , "], ["id", 3]]

		def generate_authentication_token
				loop do
						token = Devise.friendly_token
						break token unless User.where(authentication_token: token).first
---
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["authentication_token", "[FILTERED]"], ["LIMIT", 1]]